{
    "Internal server error, contact support": "Ocurrió un error interno en el servidor de Openpay.",
    "Bad Request": "El formato de la petición no es JSON, los campos no tienen el formato correcto, o la petición no tiene campos que son requeridos.",
    "The api key or merchant id are invalid": "La llamada no esta autenticada o la autenticación es incorrecta.",
    "Parameters look valid but request failed": "La operación no se pudo completar por que el valor de uno o más de los parámetros no es correcto.",
    "The resource is unavailable at this moment. Please try again later": "Un servicio necesario para el procesamiento de la transacción no se encuentra disponible.",
    "The requested resource doesn't exist": "Uno de los recursos requeridos no existe.",
    "The order_id has already been processed": "Ya existe una transacción con el mismo ID de orden.",
    "Operation rejected by processor": "La transferencia de fondos entre una cuenta de banco o tarjeta y la cuenta de Openpay no fue aceptada.",
    "The account is inactive": "Una de las cuentas requeridas en la petición se encuentra desactivada.",
    "The request is too large": "El cuerpo de la petición es demasiado grande.",
    "Method not allowed for public API key, use private key instead": "Se esta utilizando la llave pública para hacer una llamada que requiere la llave privada, o bien, se esta usando la llave privada desde JavaScript.",
    "The resource was previously deleted": "Se solicita un recurso que esta marcado como eliminado.",
    "The transaction amount exceeds your allowed transaction limit": "El monto transacción esta fuera de los limites permitidos.",
    "The operation is not allowed on the resource": "La operación no esta permitida para el recurso.",
    "Your account is inactive, please contact to soporte@openpay.mx for more information": "La cuenta esta inactiva.",
    "Could not get any response from gateway. Please try again later": "No se ha obtenido respuesta de la solicitud realizada al servicio.",
    "The merchant email has been already processed": "El mail del comercio ya ha sido procesada.",
    "The payment gateway is not available at the moment, please try again later": "El gateway no se encuentra disponible en ese momento.",
    "The number of retries of charge is greater than allowed": "El número de intentos de cargo es mayor al permitido.",
    "The number of decimal digits is not valid for this currency": "El número de dígitos decimales es inválido para esta moneda.",
    "The bank account already exists": "La cuenta de banco con esta CLABE ya se encuentra registrada en el cliente.",
    "The external_id already exists": "El cliente con este identificador externo (External ID) ya existe.",
    "The card number verification digit is invalid": "El número de tarjeta es invalido.",
    "The expiration date has expired": "La fecha de expiración de la tarjeta es anterior a la fecha actual.",
    "The CVV2 security code is required": "El código de seguridad de la tarjeta (CVV2) no fue proporcionado.",
    "The card number is only valid in sandbox": "El número de tarjeta es de prueba, solamente puede usarse en Sandbox.",
    "The card is not valid for points": "La tarjeta no es valida para pago con puntos.",
    "The CVV2 security code is invalid": "El código de seguridad de la tarjeta (CVV2) es inválido.",
    "3D Secure authentication failed": "Autenticación 3D Secure fallida.",
    "Card product type not supported": "Tipo de tarjeta no soportada.",
    "The card was declined by the bank": "La tarjeta fue declinada por el banco.",
    "The card has expired": "La tarjeta ha expirado.",
    "The card doesn't have sufficient funds": "La tarjeta no tiene fondos suficientes.",
    "The card was reported as stolen": "La tarjeta ha sido identificada como una tarjeta robada.",
    "Fraud risk detected by anti-fraud system": "La tarjeta ha sido rechazada por el sistema antifraude.",
    "Request not allowed": "La operación no esta permitida para este cliente o esta transacción.",
    "The card was reported as lost": "La tarjeta fue reportada como perdida.",
    "The bank has restricted the card": "El banco ha restringido la tarjeta.",
    "The bank has requested the card to be retained": "El banco ha solicitado que la tarjeta sea retenida. Contacte al banco.",
    "Bank authorization is required for this charge": "Se requiere solicitar al banco autorización para realizar este pago.",
    "Merchant not authorized to use payment plan": "Comercio no autorizado para procesar pago a meses sin intereses.",
    "Invalid promotion for such card type": "Promoción no valida para este tipo de tarjetas.",
    "Transaction amount is less than minimum for promotion": "El monto de la transacción es menor al mínimo permitido para la promoción.",
    "Promotion not allowed": "Promoción no permitida.",
    "There are not enough funds in the openpay account": "La cuenta de Openpay no tiene fondos suficientes.",
    "The operation can't be completed until pending fees are paid": "La operación no puede ser completada hasta que sean pagadas las comisiones pendientes.",
    "The webhook has already been processed": "El webhook ya ha sido procesado.",
    "Could not connect with webhook service, verify URL": "No se ha podido conectar con el servicio de webhook.",
    "Service responded with an error on this moment. Please try again later": "El servicio respondió con errores."
}
